kiebel/ArMARoW/include/armarow/phy/atmega128rfa1/atmega128rfa1-rc.h
/*******************************************************************************
 *
 * Copyright (c) 2010 Thomas Kiebel <kiebel@ivs.cs.uni-magdeburg.de>
 * All rights reserved.
 *
 *    Redistribution and use in source and binary forms, with or without
 *    modification, are permitted provided that the following conditions
 *    are met:
 *
 *    * Redistributions of source code must retain the above copyright
 *      notice, this list of conditions and the following disclaimer.
 *
 *    * Redistributions in binary form must reproduce the above copyright
 *      notice, this list of conditions and the following disclaimer in
 *      the documentation and/or other materials provided with the
 *      distribution.
 *
 *    * Neither the name of the copyright holders nor the names of
 *      contributors may be used to endorse or promote products derived
 *      from this software without specific prior written permission.
 *
 *
 *    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS
 *    IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
 *    TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 *    PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *    OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *    LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *    DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *
 * $Id$
 *
 ******************************************************************************/
#pragma once

#include <avr-halib/share/delay.h>
#include <avr-halib/share/delegate.h>

#include <armarow/common/crc.h>
#include <armarow/debug.h>

#include "atmega128rfa1-spec.h"
#include "register.h"
#include "framebuffer.h"

namespace armarow {
    namespace phy {
        /*! \brief  Default configuration of the ATmega128RFA1 radio controller.
         *  \ingroup RcConf
         */
        using namespace avr_halib::regmaps::local::atmega128rfa1;
        
        struct ATmega128RfA1CFG {
            enum {
                enabledCCA           = false,
                /*!< indicates whether a CCA is performed before transmitting*/
                enabledCRC           = true,
                /*!< indicates whether CRC checking of frames is enabled*/
                enabledAutoAck       = false,
                /*!< indicates whether the automatic acknowledgement is enabled*/
                enabledAddressDecode = false,
                /*!< indicates whether the automatic address decode is enabled*/
                enableConcurrence    = false,
                /*!< indicates whether interrupts can be used concurrently*/
                rxOnIdle             = true,
                /*!< indicates whether the TX mode is turned off after transmits*/
                autoCRC              = true
                /*!< inicated whether autmatic crc generation for send frames will be used*/
            };

            typedef common::CRC::Polynomials::ITU_T CRCPolynomial;
        };
        /*! \class  ATmega128RfA1 atmega128rfa1-rc.h "armarow/phy/atmega128rfa1/atmega128rfa1-rc.h"
         *  \brief  Class %ATmega128RfA1 represents the interface for the ATmega128RFA1
         *          radio controller being part of ArMARoW's physical layer.
         *
         *  \tparam Hal  hardware configuration of the radio controller
         *              (<em>usually given by a portmap</em>)
         *  \tparam CFG configuration parameters of the radio controller
         *              (\link At86Rf230CFG\endlink)
         *  \ingroup PhyL RcImpl
         */
        template < class Hal, class CFG = struct ATmega128RfA1CFG >
        class ATmega128RfA1 {
            public:
              template<class NewCFG>
              struct reconfigure{typedef ATmega128RfA1<Hal, NewCFG> type;};
                /*! \brief  definition of the class type*/
                typedef ATmega128RfA1< Hal, CFG > type;
                /*! \brief  definition of the radio controller %specification*/
                typedef armarow::phy::specification::ATmega128RfA1 spec_t;
                /*! \brief  definition of layer specific information*/
                struct info{
                    enum {
                        frame    = armarow::PHY::aMaxPHYPacketSize,
                        /*!< size of a frame (note that this parameter
                         *  coresponses to the <code>aMaxPHYPacketSize</code>
                         *  of the IEEE 802.15.4)
                         */
                        overhead = ((CFG::enabledCRC) ? 0x02 : 0x00), //FIXME check if enabledCRC is used correctly
                        /*!< overhead caused by the radio controller
                         *   configuration (CRC, aso.)
                         */
                        payload  = frame - overhead
                        /*!< available payload considering frame size and overhead */
                    };
                };
                
                /*! \brief  definition of a layer specific message object*/
                struct mob_t{
                    uint8_t size;                   /*!< number of bytes*/
                    uint8_t payload[info::frame];   /*!< frame data     */
                    struct {
                      uint8_t lqi;  /*!< last avr_halib::regmaps::locameasured LQI value*/
                      uint8_t ed;
                      bool    crc  : 1;
                    } minfo;
                };
                /*! \brief  definition of layer specific message information
                 *  \todo add information such as RSSI, CRC validity aso.
                 */
                
