kiebel/ArMARoW/include/armarow/phy/atmega128rfa1/atmega128rfa1-rc.h
          private:
#if 0
                /*! \brief  definition of interface between %MC and %RC.*/

                /*! \brief  Determins the cause of an interrupt and calls the
                 *          appropriated interrupt handler.
                 *  \note   Method is triggered by an external interrupt.
                 *  \sa     \link handleIRQ()\endlink
                 */
                void onIRQ() {
// FIXME            typename ControllerInterface_t::regval_t registerValue;
                    uint8_t registerValue;
                    
                    UseRegMap(rm, registers);
                    
                    if ( CFG::enableConcurrence ) {
                        Hal::irq_t::disable();
                        sei();
                    }
                    registerValue = rm.irq_status;
                    
                    handlerIRQ( registerValue );
                    if ( CFG::enableConcurrence ) {
                        cli();
                        Hal::irq_t::enable();
                    }
                }

                /*! \brief  Handles any interrupt caused by the
                 *          radio controller.
                 *  \note   Since no interrupts from the radio controller
                 *          are accepted while this method is running, keep
                 *          the implementation of the callback functions
                 *          short and efficient.
                 *  \sa     \link onIRQ()\endlink
                 *  \sa     \link onReceive()\endlink
                 *  \sa     \link receive(mob_t&)\endlink
                 *  \param[in] pCause interrupt status
                 */
                void handlerIRQ( typename ControllerInterface_t::regval_t pCause) {
//FIXME             UseRegMap(rm, registers)

                    if ( pCause.irq.bat_low  ) {} //TODO power supply low
                    if ( pCause.irq.trx_ur   ) {} //TODO buffer underrun
                    if ( pCause.irq.rx_start ) {
                        //rc.readRegister(  spec_t::registerDefault::phyRssi, registerValue );
                        //FIXME minfo.rxRssi = registerValue.phyRssi.RSSI;
                    }
                    if ( pCause.irq.trx_end ) {
                        armarow::PHY::State cState = (armarow::PHY::State)this->getStateTRX();
                        switch(cState)
                        {
                          case(armarow::PHY::rx_on ): this->onReceive();
                          break;
                          
                          case(armarow::PHY::tx_on ): if(CFG::rxOnIdle)
                            this->setStateTRX( armarow::PHY::rx_on );
                            break;
                          default:
                            break;
                        }
                    }
                }
#endif
                void handlerIRQ_trxend() {

                        armarow::PHY::State cState = (armarow::PHY::State)this->getStateTRX();
                        switch(cState)
                        {
                          case(armarow::PHY::rx_on ): this->onReceive();
                          break;
                          
                          case(armarow::PHY::tx_on ): if(CFG::rxOnIdle)
                            this->setStateTRX( armarow::PHY::rx_on );
                            break;
                          default:
                            break;
                        }
                }
                void handlerIRQ_rxstart() {
//                     if ( pCause.irq.rx_start ) {
                        //rc.readRegister(  spec_t::registerDefault::phyRssi, registerValue );
                        //FIXME minfo.rxRssi = registerValue.phyRssi.RSSI;
//                     }
                }

                /*! \brief  Checks the radio controller for pending operations.
                 *  \returns  Returns TRUE if radio controller finished
                 *            transmitting or receiving otherwise FALSE.
                 *  \todo rework the way an blocking send/recv works (use of ready??)
                 */
                bool ready() {
                    switch ( getStateTRX() ) {
                        case armarow::PHY::busy_rx:
                        case armarow::PHY::busy_tx:
                            return false;
                        case armarow::PHY::tx_on:
                            if ( CFG::rxOnIdle ) setStateTRX( armarow::PHY::rx_on );
                        case armarow::PHY::rx_on:
                            //FIXME do something here ....!!! what happens after succesfull recv?
                        case armarow::PHY::trx_off:
                            return true;
                        default:
                            return false;
                    }
                }
            public:
                /*! \brief  Interrupt service routine that is triggered
                 *          if data for the next layer is available.
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PD-DATA.indication-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 */
                Delegate<> onReceive;

                /*! \brief Constructor of the ATmega128RFA1 radio controller.
                 *
                 *  Initializes and resets the radio controller hardware using
                 *  \link reset()\endlink, as well as maps interrupts of the
                 *  radio controller to <code>onIRQ()</code>.
                 */
                ATmega128RfA1() {
                    // configure radio controller hardware
                    UseRegMap(rm, registers);
                    rm.trx_reset=true;
                    rm.sleep_tr=true;
                    SyncRegMap(rm);
                    delay_us( spec_t::Duration::trx_chip_reset_time_us );
                    // map interrupt to method onIRQ()
//FIXME             Hal::irq_t::template init<type,&type::onIRQ>(this);
                    //done within init
                    
                  
                    
