kiebel/ArMARoW/include/armarow/phy/atmega128rfa1/atmega128rfa1-rc.h
                }
                ~ATmega128RfA1() {}

                /*! \brief  (Re)Initializes the ATmega128RFA1 radio controller by
                 *          initializing the hardware used.
                 */
                void init() {

                    // transceiver initialization
                    UseRegMap(rm, registers);
                    SyncRegMap(rm);
                    if ( rm.trx_status != spec_t::defaultValue::trx_off ) {
                        if ( rm.trx_status !=  spec_t::defaultValue::p_on ) {
                            reset();                    // reset chip and set TRX_OFF
                        }
                        rm.sleep_tr = false; // sleep pin to LOW
                        rm.trx_reset=true;// reset pin to HIGH
                        SyncRegMap(rm);                        
                    }

                    // disable IRQ and clear any pending IRQs
                    rm.irq_mask=0x00;
                    SyncRegMap(rm); 
                    rm.irq_status=0xff;
                    SyncRegMap(rm); 
                    rm.trx_cmd = spec_t::defaultValue::trx_off;
                    SyncRegMap(rm); 
                    delay_us( spec_t::Duration::trx_init_time_us );

                    // check current state and stop if state is not trx_off
                    // since something must be wrong!!!
                    SyncRegMap(rm);
                    if( rm.trx_status != spec_t::defaultValue::trx_off) 
                      while (true); //stop
                   
                    rm.tx_auto_crc_on = CFG::autoCRC;
                    SyncRegMap(rm);
                    
                    //setup irqhandler
                    /* TRX24 - Receive start interrupt */
                    redirectISRM(TRX24_RX_START_vect, &type::handlerIRQ_rxstart, *this);
                    /*TRX24 - RX_END interrupt */
                    redirectISRM(TRX24_RX_END_vect, &type::handlerIRQ_trxend, *this);
                    /* TRX24 - TX_END interrupt */
                    redirectISRM(TRX24_TX_END_vect, &type::handlerIRQ_trxend, * this);
                   
                    //setup irqMask
                    rm.tx_end_enable=true;
                    rm.rx_end_enable=true;
                    rm.rx_start_enable=true;
                    SyncRegMap(rm);
                }

                /*! \brief  Resets the ATmega128RFA1 radio controller.
                 *  \note   After reset was called the radio controller is
                 *          in state <code>TRX_OFF</code>.
                 */
                void reset() {
                    UseRegMap(rm, registers);
                    rm.trx_reset = false;  // reset pin LOW
                    SyncRegMap(rm);
                    delay_us( spec_t::Duration::trx_reset_time_us );
                    rm.trx_reset = true;   // reset pin HIGH
                    SyncRegMap(rm);
                    delay_us( spec_t::Duration::trx_chip_reset_time_us );
                }

                /*! \brief  Transmits provided data via the radio connection.
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PD-DATA.request-primitive</code> as
                 *          defined in IEEE 802.15.4.
                 *  \sa     \link send_blocking \endlink
                 *  \param[in] pData layer specific message object
                 *  \returns  Returns the status of the operation
                 *            (<em>note that the status is similar to an
                 *            invocation of the
                 *            <code>PD-DATA.confirm-primitive</code> as
                 *            defined in IEEE 802.15.4</em>)
                 */
                armarow::PHY::State send(mob_t& pData) {
                    TRACE_FUNCTION;
                    // check if TX is enabled and no transmission is taking place
                    armarow::PHY::State cState = getStateTRX();
                    if ( cState != armarow::PHY::tx_on ) return cState;
                    // do nothing if size equals zero
                    if ( pData.size == 0) {
                        if ( CFG::rxOnIdle ) setStateTRX( armarow::PHY::rx_on );
                        return armarow::PHY::success;
                    }

                    // alter size if CRC is enabled
                    
                    uint8_t size = pData.size+info::overhead;
                    
                    if ( size > armarow::PHY::aMaxPHYPacketSize )
                        return armarow::PHY::invalid_parameter;
                    
                    if(CFG::enabledCRC && !CFG::autoCRC)
                        *((uint16_t*)(pData.payload+pData.size))=common::CRC::calculateCRC<typename CFG::CRCPolynomial>(pData.payload, size);
                    
                    UseRegMap(fb,trxframebuffer);
                    fb.trxfb[0]=size;
                    for(uint8_t i = 0; i< (CFG::autoCRC?size-2:size) ;i++)
                    {
                      fb.trxfb[i+1] = pData.payload[i];
                    }
                    
                    UseRegMap(rm, registers);
                    // start sending
                    SyncRegMap(rm);
//                     SyncRegister(rm, rm.trx_state);
                    rm.trx_cmd = spec_t::defaultValue::tx_start;
                    SyncRegMap(rm);
//                    SyncRegister(rm, rm.trx_state);
                    
                    return armarow::PHY::success;
                }

                /*! \brief  Transmits provided data via the radio connection and
                 *          waits until transmission has finished.
                 *  \note   Method blocks until transmission finished or failed.
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PD-DATA.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *  \sa     \link send() \endlink
                 *  \param[in] pData layer specific message object
                 *  \returns  Returns the status of the operation
                 *            (<em>note that the status is similar to an
                 *            invocation of the
                 *            <code>PD-DATA.confirm-primitive</code> as
                 *            defined in IEEE 802.15.4</em>)
                 */
#if 0 
                Niemand will blockierend senden (und wenn dann soll er selber blockieren)
                armarow::PHY::State send_blocking(mob_t& pData) {
                    TRACE_FUNCTION;
                    armarow::PHY::State result = send(pData);
                    while( ( result == armarow::PHY::success ) && !ready() );
                    return result;
                }
#endif

                /*! \brief  Gets the last received message and fills it into the
                 *          provided data structure.
                 *  \sa     \link receive_blocking()\endlink
                 *  \param[in] pData layer specific message object
                 *  \returns  Returns the size of the message received.
                 */
                uint8_t receive(mob_t& pData) {
                    TRACE_FUNCTION;
                    // read data from RXFIXO and set lqi value
                    UseRegMap(fb,trxframebuffer);
                    SyncRegMap(fb);
                    
