kiebel/ArMARoW/include/armarow/phy/atmega128rfa1/atmega128rfa1-rc.h
                    pData.size=(fb.rxlength<=info::frame)?fb.rxlength:0; //get Framesize check length
                    { //read framebuffer (frame and lqi)
                      uint8_t i=0;
                      for(;i<pData.size;i++)
                      {
                        pData.payload[i]=fb.trxfb[i];
                      }
                      pData.minfo.lqi=fb.trxfb[i];
                    }
                    pData.size = (pData.size>0)?(pData.size-info::overhead):0;

                    UseRegMap(rm, registers);
                    SyncRegMap(rm);
                    pData.minfo.ed=rm.phy_ed_level;
//                     rc.readRegister(spec_t::registerDefault::phyEd, registerValue);
//                     pData.minfo.ed=registerValue.value;
//                     registerValue.value=0;
                    if(CFG::autoCRC)
                    {
                      pData.minfo.crc=rm.rx_crc_valid;
                    }
                    else
                    {
                      uint16_t recvCrc[2]={pData.payload[pData.size], pData.payload[pData.size+1]};
                      common::CRC::calculateCRC<typename CFG::CRCPolynomial>(pData.payload, pData.size+2);
                      if(recvCrc[0]==pData.payload[pData.size] && recvCrc[1]==pData.payload[pData.size+1])
                        pData.minfo.crc=true;
                      else
                        pData.minfo.crc=false;
                    }
                    return pData.size;
                }

                /*! \brief  Blocks until a message was received and fill this
                 *          message into the provided data structure.
                 *  \sa     \link receive()\endlink
                 *  \note   Method blocks until transmission finished or failed.
                 *  \param[in] pData layer specific message object
                 *  \return Returns the size of the message received.
                 */
#if 0
                uint8_t receive_blocking(mob_t& pData) {
                    TRACE_FUNCTION;
                    while( !ready() );//FIXME does not work as predicted rethink
                    return receive(pData);
                }
#endif
                /*! \brief  Checks if the medium is available by performing
                 *          a CCA (<em>Clear Channel Assesment</em>).
                 *  \sa     \link armarow::phy::RadioControllerCFG::enabledCCA\endlink
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PLME-CCA.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *
                 *  \returns  The result of the CCA which is similar to an
                 *            invocation of the
                 *            <code>PLME-CCA.confirm-primitive</code>
                 *            as defined in IEEE 802.15.4 (possible values
                 *            are <code>TRX_OFF</code>,
                 *            <code>BUSY, IDLE</code>)
                 */
                armarow::PHY::State doCCA(uint8_t& value) { //FIXME still untested
                    TRACE_FUNCTION;
                    
                    armarow::PHY::State cState = (armarow::PHY::State)getStateTRX();
                    if ( cState == armarow::PHY::trx_off ) return cState;
                    if ( cState != armarow::PHY::rx_on ) return armarow::PHY::busy;

                    // do the actual check of the medium
                    UseRegMap(rm, registers);
                    rm.cca_request = true;
                    SyncRegMap(rm);
                    
                    //delay_us( spec_t::Duration::trx_cca_time_us );
                    
                    // CCA_DONE and CCA_STATUS are valid only for one read
                    do{
                      SyncRegMap(rm);
                    }while(!rm.cca_done);

                    value=rm.cca_status;
                    
                    return armarow::PHY::success;
                }

                /*! \brief  Performs an energy detection on the medium without
                 *          trying to decode any data.
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PLME-ED.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *
                 *  \param[out] pEnergyLevel detected level of energy
                 *  \returns  The status of the energy detection which is
                 *            similar to an invocation of the
                 *            <code>PLME-ED.confirm-primitive</code> as
                 *            defined in IEEE 802.15.4 (possible values are
                 *            <code>SUCCESS</code>, <code>TRX_OFF</code>,
                 *            <code>TX_ON</code>)
                 */
                armarow::PHY::State doED(uint8_t& pEnergyLevel) {//FIXME still untested
                    TRACE_FUNCTION;

                    armarow::PHY::State cState = (armarow::PHY::State)getStateTRX();
                    if ( ( cState == armarow::PHY::rx_on) ||
                         ( cState == armarow::PHY::busy_rx) ) 
                    {
                        UseRegMap(rm, registers);
                        rm.phy_ed_level=0;
                        SyncRegMap(rm);
                        delay_us( spec_t::Duration::trx_cca_time_us );
                        SyncRegMap(rm);
                        pEnergyLevel = spec_t::dBmToPaLevel(rm.phy_ed_level);//FIXME check conversion
                        
                        return armarow::PHY::success;
                    }
                    return cState;
                }

                /*! \brief  Requests the value of a PAN Information Attribute.
                 *  \sa     \link setAttribute()\endlink
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PLME-GET.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *
                 *  \param[in]  pAttribute specifies attribute requested
                 *              (for possible values see
                 *              \link PHY::PIBAttribute\endlink)
                 *  \param[out] pAttrValue pointer to the value of the
                 *              attribute (note that the caller has to
                 *              provide an appropriated buffer for the
                 *              attribute)
                 *  \returns  The status of the operation similar to an
                 *            invocation of the
                 *            <code>PLME-GET.confirm-primitive</code> as
                 *            defined in IEEE 802.15.4 (possible values are
                 *            <code>SUCCESS</code>,
                 *            <code>UNSUPPORTED_ATTRIBUTE</code>)
                 *  \todo add phyMaxFrameDuration, phySHRDuration, phySymbolsPerOctet
                 */
                armarow::PHY::State getAttribute(armarow::PHY::PIBAttribute pAttribute, void* pAttrValue) {
//                     typename ControllerInterface_t::regval_t registerValue;
                        UseRegMap(rm, registers);
                        SyncRegMap(rm);
                    switch (pAttribute) {
                        case armarow::PHY::phyCurrentChannel:
                            *((uint8_t*)pAttrValue) =  rm.channel;
                            break;
                        case armarow::PHY::phyChannelsSupported:
                            *((uint32_t*)pAttrValue) = spec_t::Channel::supportedChannel();
                            break;
                        case armarow::PHY::phyTransmitPower:
                            *((uint8_t*)pAttrValue) = rm.tx_power;
                            break;
                        case armarow::PHY::phyCCAMode:
                            *((uint8_t*)pAttrValue) = rm.cca_mode;
                            break;
                        case armarow::PHY::phyCurrentPage:
                            // note that only page 0x00 is curently supported
                            *((uint8_t*)pAttrValue) = 0x00;
                            break;
                        case armarow::PHY::phyMaxFrameDuration:             //FIXME
                        case armarow::PHY::phySHRDuration:                  //FIXME
                        case armarow::PHY::phySymbolsPerOctet:              //FIXME
                            break;
                        default:
                            return armarow::PHY::unsupported_attribute;
                    }
                    return armarow::PHY::success;
                }

                /*! \brief  Sets the value of a PAN Information Attribute.
                 *  \sa     \link getAttribute()\endlink
                 *  \note   A call to this method is similar to an invocation
                 *          of the <code>PLME-SET.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *
                 *  \param[in]  pAttribute defines attribute to be changed
                 *              (for possible values see
                 *              \link PHY::PIBAttribute\endlink)
                 *  \param[in]  pAttrValue value of the attribute
                 *
                 *  \returns  The status of the operation similar to an
                 *            invocation of the
                 *            <code>PLME-SET.confirm-primitive</code> as
                 *            defined in IEEE 802.15.4 (possible values are
                 *            <code>SUCCESS</code>,
                 *            <code>UNSUPPORTED_ATTRIBUTE</code>,
                 *            <code>INVALID_PARAMETER</code>,
                 *            <code>READ_ONLY</code>)
                 */
                armarow::PHY::State setAttribute(armarow::PHY::PIBAttribute pAttribute, void* pAttrValue) {
                    UseRegMap(rm, registers);
                    SyncRegMap(rm);

                    switch (pAttribute) {
                        case armarow::PHY::phyCurrentChannel:
                            if ( ( *((uint8_t*)pAttrValue) >= spec_t::Channel::minChannel) &&
                                    ( *((uint8_t*)pAttrValue) <= spec_t::Channel::maxChannel) )
                            {
                                rm.channel = *((uint8_t*)pAttrValue);
                                SyncRegMap(rm);
                            } else {
                                return armarow::PHY::invalid_parameter;
                            }
                            break;
                        case armarow::PHY::phyTransmitPower:
                            if ( *((uint8_t*)pAttrValue) <= 15 )
                            {
                                rm.tx_power = *((uint8_t*)pAttrValue);
                                SyncRegMap(rm);
                            } else {
                                return armarow::PHY::invalid_parameter;
                            }
                            break;
                        case armarow::PHY::phyCCAMode:
                            if ( *((uint8_t*)pAttrValue) <= 3 )
                            {   
                                rm.cca_mode = *((uint8_t*)pAttrValue); 
                                SyncRegMap(rm);
                            } else {
                                return armarow::PHY::invalid_parameter;
                            }
                            break;
                        case armarow::PHY::phyCCAThres:
                            if ( *((uint8_t*)pAttrValue) <= 15 )
                            {
                                rm.cca_threshold = *((uint8_t*)pAttrValue);
                                SyncRegMap(rm);
                            } else {
                                return armarow::PHY::invalid_parameter;
                            }
                            break;

                        case armarow::PHY::phyCurrentPage:
                            if ( *((uint8_t*)pAttrValue) != 0x00)
                                return armarow::PHY::invalid_parameter;
                            break;
                        case armarow::PHY::phyChannelsSupported:
                        case armarow::PHY::phyMaxFrameDuration:
                        case armarow::PHY::phySHRDuration:
                        case armarow::PHY::phySymbolsPerOctet:
                            return armarow::PHY::read_only;
                        default:
                            return armarow::PHY::unsupported_attribute;
                    }
                    return  armarow::PHY::success;
                }

