kiebel/ArMARoW/include/armarow/phy/atmega128rfa1/atmega128rfa1-rc.h
                /*! \brief  Gets the state (<em>working mode</em>) of the
                 *          transceiver.
                 *  \sa     \link setStateTRX() \endlink
                 *  \note   A call to this method is similar to an invocation
                 *          of the
                 *          <code>PLME-GET-TRX-STATE.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *  \return Returns current state of the radio controller
                 *          (available modes are <code>RX_ON</code>,
                 *          <code>TRX_OFF</code>, <code>BUSY_RX</code>,
                 *          <code>BUSY_TX</code>, <code>TX_ON</code>).
                 */
                armarow::PHY::State getStateTRX() {
                    UseRegMap(rm, registers);
                    SyncRegMap(rm);
                    return (armarow::PHY::State) rm.trx_status;
                }
                
                /*! \brief  Sets the state (<em>working mode</em>) of the
                 *          transceiver.
                 *  \sa     \link getStateTRX() \endlink
                 *  \note   A call to this method is similar to an invocation
                 *          of the
                 *          <code>PLME-SET-TRX-STATE.request-primitive</code>
                 *          as defined in IEEE 802.15.4.
                 *  \param[in]  pState new working mode (available modes are
                 *              <code>RX_ON,</code> <code>TRX_OFF</code>,
                 *              <code>FORCE_TRX_OFF</code>,
                 *              <code>TX_ON</code>)
                 */
                void setStateTRX(const armarow::PHY::State pState) {
                    
                    UseRegMap(rm, registers);
                    SyncRegMap(rm);
                    
                    switch(pState) {
                        case armarow::PHY::rx_on:
                            if ( (rm.trx_status == spec_t::defaultValue::trx_off) ||
                                    (rm.trx_status == spec_t::defaultValue::pll_on) ) {
                                rm.trx_cmd = spec_t::defaultValue::rx_on;
                                do {
                                    SyncRegMap(rm);
                                } while ( rm.trx_status != spec_t::defaultValue::rx_on );
                            }
                           break;
                        case armarow::PHY::trx_off:
                            if ( (rm.trx_status == spec_t::defaultValue::rx_on) ||
                                    (rm.trx_status == spec_t::defaultValue::pll_on) ) {
                                rm.trx_cmd = spec_t::defaultValue::trx_off;
                                SyncRegMap(rm);
                            }
                            break;
                        case armarow::PHY::tx_on:
                            if ( (rm.trx_status == spec_t::defaultValue::trx_off) ||
                                    (rm.trx_status == spec_t::defaultValue::rx_on) ) {
                                rm.trx_cmd = spec_t::defaultValue::pll_on;
                                do {
                                    SyncRegMap(rm);
                                } while ( rm.trx_status != spec_t::defaultValue::pll_on );
                            }
                            break;
                        case armarow::PHY::force_trx_off:
                            reset();
                            break;
                        default:
                            break;
                    }
                }
                
                void sleep() {
                  setStateTRX(PHY::trx_off);
                  UseRegmap(rm, registers);
                  rm.sleep_tr=true;
                  SyncRegmap(rm);
                }
                
                void wakeup() {
                  UseRegmap(rm, registers);
                  rm.sleep_tr=true;
                  SyncRegmap(rm);
                }
        };
    }; // end namespace phy
}; // end namespace armarow
